\documentclass{article}

\usepackage[francais]{babel}
\def\printlandscape{\special{landscape}}    % Works with dvips.
%\usepackage{pstricks,pst-node,pst-tree}
%\usepackage{amssymb}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc} 
\usepackage{fancybox} % for shadow and Bitemize
\usepackage{alltt}
\usepackage{graphicx}
\usepackage{caption} 


%\usepackage{epsfig}
\usepackage{fullpage}
%\usepackage{fancyhdr}
%\usepackage{moreverb}
%\usepackage{xspace}
\usepackage[colorlinks,hyperindex,bookmarks,linkcolor=blue,citecolor=blue,urlcolor=blue]{hyperref}
\usepackage{array,multirow,makecell}
\setcellgapes{1pt}
\makegapedcells
\newcolumntype{R}[1]{>{\raggedleft\arraybackslash }b{#1}}
\newcolumntype{L}[1]{>{\raggedright\arraybackslash }b{#1}}
\newcolumntype{C}[1]{>{\centering\arraybackslash }b{#1}}
\usepackage{wrapfig}
\usepackage{epsf}
\usepackage{framed}

\usepackage{fancyvrb}
\usepackage{xcolor}
\definecolor{Zgris}{rgb}{0.87,0.85,0.85}

\newsavebox{\BBbox}

\newenvironment{DDbox}[1]{
	\begin{lrbox}{\BBbox}\begin{minipage}{\linewidth}}
		{\end{minipage}\end{lrbox}\noindent\colorbox{Zgris}{\usebox{\BBbox}} \\
		[.5cm]}

\title{Rapport de Projet GMIN332 :\\ Gestion de données complexes}

\author{Par : ALIJATE Mehdi - COUSOT Kevin - NEGROS Hadrien}

\date{15 Janvier 2014}

         
\begin{document}

\maketitle
\tableofcontents

\begin{abstract}
Accès et consultation de données provenant de différentes solutions de persistance (gros volumes de données distribuées et hétérogènes) au travers d'un démonstrateur.
\end{abstract}

\newpage 
%-----------------------------------------------------------
\section{Introduction}\label{sec:intro}
Les systèmes NoSQL et les technologies du Web Sémantique sont une alternative aux SGBD classiques. Si ils sont encore très loin d'être autant utilisé que celles du monde relationnel classique, de grands acteurs d'internet (\textit{comme Facebook (Cassandra Project puis HBase), Google (BigTable), Ubuntu One (CouchDB)... etc.}) commencent à exploiter des bases de données de type NoSQL.
L'avantage de cela, c'est que la majorité de ces projets est open source et sous licence libre.
\\
Dans notre projet, nous avons voulu explorer les différentes technologies qui puissent gérer des données RDF. Nous avons donc étudié une solution basée sur le mapping de bases relationnelles (\textbf{D2RQ}), et des solutions basées sur des bases NoSQL (\textbf{TDB, Hbase et Neo4j}).
\\
Le but de ce projet est d'exploiter différentes sources de données, gérées au travers de plusieurs systèmes de gestion de données, afin de permettre un accès et consultation de ces derniers. Ceci, via une application permettant d'interconnecter ces sources de données, basée sur l'API de Jena.

%-----------------------------------------------------------

\section{Jeu de données}

\subsection{Description}

Nous avons fait appel à trois sources  :
\begin{itemize}
	\item L'\textbf{INSEE} (Institut National de la Statistique et des Études Économiques) collecte, produit, analyse et diffuse des informations sur l'économie et la société française.
	A ce titre, il conduit des recensements et des enquêtes, gère des bases de données et exploite aussi des sources administratives.
	Les données proposée sont issues du Code officiel géographique (COG) concernant notamment les régions, les départements, les arrondissements, les cantons et les communes.
	\item \textbf{Geonames}\footnote{www.geonames.org}, une base de données géographique gratuite et librement accessible sur Internet.
	La base regroupe plus de 8 millions de noms de lieux géographiques, et beaucoup d’informations autours de ces lieux (par exemple la  population, la subdivision administrative, le code postal, la latitude, la longitude, l'altitude, etc.). 
	\item La plateforme ouverte des données publiques françaises (www.data.gouv.fr/) qui fournit des données sur diverses thématiques, telles que l'agriculture et l'alimentation, la culture, les territoires et les transports.
	Nous avons fait le choix d'un jeu de données sur les résidences de tourisme classées en France.
\end{itemize}

\subsection{Schéma}


\begin{center}
	\includegraphics[scale=0.5]{interconnexion.png} 
	\captionof{figure}{Les données et leurs connexions}
	\label{fig_interconnexion}
\end{center}

\section{Analyse du système}

\subsection{Différents modèles de représentation des données}

\subsubsection{Modèle relationnel}
Le modèle relationnel est le modèle de représentation le plus utilisé dans les SGBD actuellement. Il est basé sur l'algèbre relationnelle. Une telle BDD est un ensemble de \textit{tuples} groupés ensemble dans des \textit{tables}, et un ensemble de contraintes qui, entre autre, permettent de définir des liens entre elles.
Pour pouvoir exploiter des données stockées dans une BDD relationelle en meme temps que des données stockée dans des BDD NoSQL, nous avons besoin d'une interface qui nous permettra de requêter dans un langage commun, différent donc de SQL.\\
Le SGBD que nous avons choisi est \textbf{MySQL}, et l'interface \textbf{D2RQ}.
\subsubsection{Triple Store}
Un Triple Store est une base de donnée NoSQL conçue pour stocker des triplets RDFs. La consultation des données se fait avec le langage de requête \textbf{Sparql}. 
La création d'un TDB store à pour effet de creer des fichiers persistant dans un dossier précisé en entrée. Les fichiers de données RDF sont donc chargés une fois, puis l'accès aux données se fait en chargeant ce dossier dans notre application. Le seul type de donnée qu'un triple store peut stocker est le \textit{triplet}. Contrairement au relationnel, ce modèle ne dépend donc pas d'un schéma.\\
Le triple store que nous avons décidé d'intégrer est \textbf{TDB}.
\subsubsection{Base de données orientée graphe}
Une base de données orientée graphe est une BDD NoSQL utilisant la théorie des graphes. Les données sont donc représentées sous forme de noeuds et d'arcs représentant ces noeuds. Ce modèle est pratique pour la représentation de données, car dans beaucoup de cas les données sont facilement représentables sous forme de graphe.\\
La base de donnée orientée graphe que nous avons décidé d'intégré est \textbf{Neo4j}
\subsubsection{Base de données orientée colonnes}\label{sec:Hbase}
Une base de données orientée colonne est une BDD qui stocke les données sous forme de colonnes, contrairement aux BDD relationnelles qui les stockent par lignes (tuples). \\
L'intérêt est de sérialisé les colonnes les unes après les autres, alors que l'orientation "ligne" écrit chaque entité les unes après les autres.\\
Les lignes des tables sont partitionnées en plusieurs regions, qui sont stockées dans des region servers. Celles-ci se créent automatiquement au fûr et à mesur de l'augmentation de la taille (un seuil limite est défini). Ainsi, le contenu des region servers est indexé dans un serveur master, qui dirge les clients vers le nœud adéquat. \\
Enfin, ZooKeeper est un logiciel de gestion de configuration pour systèmes distribués. Celui-ci est utilisé pour définir les instances Hadoop faisant partie du cluster HBase. Le fonctionnement de Hbase est expliqué dans le schéma suivant : 
\begin{center}
\includegraphics[scale=0.5]{hbase-shema.png} 
\captionof{figure}{Vue Générale du fonctionnement de Hbase}
\label{fig_hbase}
\end{center}
Source :  Cf. Hbase dans \ref{sec:shbase}.


 
\subsection{Une API pour les gouverner tous: Jena}\label{sec:Jena}

Jena est une API Java qui peut être utilisée pour créer et manipuler des données RDF . Jena possède des classes pour représenter des graphes, des ressources, des propriétés et des littéraux.

Ce projet est uni autour de l'API de Jena (Cf. Section \ref{sec:Jena}) et de ses modèles.
\begin{center}
\includegraphics[scale=0.5]{archi_jena.jpeg} 
\captionof{figure}{Vue Générale de l'architecture JENA}
\label{fig_jena}
\end{center}

\begin{center}
\includegraphics[scale=0.5]{archi_D2RQ.jpeg} 
\captionof{figure}{Vue Générale de l'architecture D2RQ}
\label{fig_d2rq}
\end{center}


\subsection{Le langage de requete SPARQL}\label{sec:Sparql}
La réprésentation Model spécifique à Jena a permis l'union obtenue à partir de nos sources de données. Les requêtes SPARQL sont effectuées sur le modèle ainsi créé.\\
Chaque triple store définit ses propres fonctions à côté de celles de SPARQL (ARQ pour Jena). Pour gérer les requêtes SPARQL, Jena utilise sa propre librairie \textit{ARQ}. Cette librairie définit également sa propre syntaxe, compatible notre mode de requêtage SPARQL, cela y ajoute des fonctionnalités semblables à ce qu'on peut trouver dans MySql par exemple, comme COUNT, MAX, etc, car ces fonctions ne sont pas gérées par défaut par SPARQL.



%-----------------------------------------------------------
\section{Application}
\subsection{Généralités}
Notre application se base sur un modèle JENA (Cf. \ref{sec:Jena}) construit, avec des données réparties, comme vu au dessus, au sein de différents systèmes de stockage\\
Le modèle JENA sert donc d'union ou interconnexion de ces données, pour qu'on puisse à la fin intérroger ce dernier via des requêtes SPARQL(Cf. \ref{sec:Sparql}), sur n'importe quel type de données sans devoir dépendre d'un type de stockage précis. 

\subsection{Architecture}
Le but est de pouvoir respecter l'architecture ou le schéma suivant : \\
\begin{center}
\includegraphics[scale=0.5]{archi_appli.png} 
\captionof{figure}{Architecture ou schéma de fonctionnement de l'application}
\label{fig_appli}
\end{center}
Chaque système est géré séparément et crée son propre modèle JENA, tandis qu'un autre module est chargé d'en faire l'union en un unique modèle et de l'interroger.

\begin{itemize}
\item Pour D2RQ : c'est la fonction \texttt{construireD2RQModel} de la classe \texttt{Union} qui crée un modèle à partir des données de l'\textbf{INSEE} et d'un fichier de mapping spécialement écrit.
\item Pour TDB : la fonction \texttt{construireTDBModel} de la classe \texttt{Union} construit un modèle depuis les données de \textbf{Géoname} décrites par un ontologie.
\item Pour Neo4j : la classe \texttt{Neo4jConstructor} transforme une bdd graphe précédemment créée à partir des données de \href{http://www.data.gouv.fr/fr}{data.gouv.fr} en un modèle JENA.


\end{itemize}



\section{Démonstration}

\subsection{Principe}

Au lancement de l'application, les différentes différents systèmes de gestion se lancent et chargent leur propre source de données.
Celles-ci sont ensuite fusionnées, et le vocabulaire commun, celui de l'\textbf{INSEE} permet de les mettre en relation les uns les autres.
Une liste de requête s'affiche, et l'utilisateur est invité à choisir celles qui l'intéresse.

\subsection{Requêtes}


La première requête illustre le lien avec les données de \href{http://www.data.gouv.fr/fr}{data.gouv.fr} (Neo4j) et celles
de l'\textbf{INSEE} (D2QRQ), et retourne la liste des résidences de tourismes présentes dans le Calvados.
\medskip

\begin{DDbox}{\linewidth}
\begin{Verbatim}
SELECT ?c ?nom
WHERE
{
[vocab:departement_nccenr "Calvados"] vocab:departement_departement ?d .
[vocab:cog_r_codeDep ?d] igeo:codeINSEE ?c .
?r gmin332:APourCodePostal [igeo:codeINSEE ?c] .
?r gmin332:nomCommercial ?nom
}
\end{Verbatim}
\end{DDbox}

\begin{DDbox}{\linewidth}
	\begin{Verbatim}
-----------------------------------------------------------------
| c       | nom                                                 |
=================================================================
| "14160" | "RESIDENCE MAEVA PORT GUILLAUME"                    |
| "14600" | "LA CLOSERIE HONFLEUR"                              |
| "14600" | "R?SIDENCE ADONIS LES HAUTS DE HONFLEUR"            |
| "14600" | "ODALYS \"\"LE CHATEAU DE PR?TREVILLE\"\""          |
| "14390" | "ODALYS R?SIDENCE MONTAIGU"                         |
| "14390" | "ODALYS R?SIDENCE GREEN PANORAMA"                   |
| "14390" | "LA CLOSERIE CABOURG - C?T? CASINO"                 |
| "14640" | "LE DOMAINE DE LA CORNICHE"                         |
| "14360" | "R?SIDENCE MAEVA LES TAMARIS"                       |
| "14520" | "RESIDENCE PIERRE ET VACANCES LE GREEN BEACH "      |
| "14510" | "R?SIDENCE DES VILLAS D'HOULGATE"                   |
| "14430" | "PIERRE ET VACANCES VILLAGES CLUBS NORMANDY GARDEN" |
-----------------------------------------------------------------
\end{Verbatim}
\end{DDbox}

La seconde met en évidence les 10 communes avec le plus grand nombre de résidences de tourisme.
\medskip
\begin{DDbox}{\linewidth}
	\begin{Verbatim}
SELECT ?nom (count(?r) as ?nbResidences)
WHERE
{
  ?r gmin332:APourCodePostal [igeo:codeINSEE ?codeInsee] .
  [igeo:codeINSEE ?codeInsee] vocab:cog_r_nccenr ?nom.
}
GROUP BY ?nom
ORDER BY DESC (?nbResidences) LIMIT 10
\end{Verbatim}
\end{DDbox}

\begin{DDbox}{\linewidth}
	\begin{Verbatim}
-----------------------------------------
| nom                    | nbResidences |
=========================================
| "Puygros"              | 22           |
| "Tresserve"            | 11           |
| "Villargondran"        | 11           |
| "Entremont"            | 9            |
| "Bordères-sur-l'Échez" | 8            |
| "Estampures"           | 7            |
| "Nahuja"               | 7            |
| "Doazon"               | 6            |
| "Grignon"              | 6            |
| "Lieoux"               | 6            |
-----------------------------------------
\end{Verbatim}
\end{DDbox}

La troisième requête tente de connecter les trois sources de données, en cherchant les 10 communes avec le plus grand nombre
de résidences de tourisme associées à leur population. 
\textbf{Geoname}  ne comprenant pas de code postaux, nous avons essayé de lier par le nom de commune. Malheureusement ces nom n'apparaissant pas sous leur
forme normale, les résultats sont incomplets.

\begin{DDbox}{\linewidth}
	\begin{Verbatim}
SELECT ?nom (count(?r) as ?nbResidences) ?pop
WHERE
{
  ?r gmin332:APourCodePostal [igeo:codeINSEE ?codeInsee] .
  [igeo:codeINSEE ?codeInsee] vocab:cog_r_nccenr ?nom .
  [gn:name ?nom] gn:population ?pop
}
GROUP BY ?nom ?pop
ORDER BY DESC (?nbResidences)
LIMIT 10
\end{Verbatim}
\end{DDbox}
\begin{DDbox}{\linewidth}
\begin{Verbatim}
------------------------------------------------------
| nom                       | nbResidences | pop     |
======================================================
| "Grand-Brassac"           | 3            | "530"   |
| "Lugos"                   | 2            | "833"   |
| "Mauzac-et-Grand-Castang" | 2            | "845"   |
| "Cherveix-Cubas"          | 1            | "622"   |
| "Donnenheim"              | 1            | "260"   |
| "Lamentin"                | 1            | "15785" |
| "Manspach"                | 1            | "555"   |
| "Riedseltz"               | 1            | "1121"  |
| "Saint-Vincent-de-Cosse"  | 1            | "374"   |
| "Salles"                  | 1            | "6044"  |
------------------------------------------------------
=======
Donner l'ensemble des résidences de tourismes avec leurs codes postales dans le Calvados (14) : \\

\begin{DDbox}{\linewidth}
\begin{Verbatim}
        float cosinus  (float x, int maxIteration)
        {
           /* encore du code ici */
        }

\end{Verbatim}
\end{DDbox}
%-----------------------------------------------------------


\section{Discussion et Conclusion }
Durant la réalisation de ce projet, il a été constaté qu'il serait plus intéressant de distribuer les données sur des sites différents et notamment, pour Neo4j, ne pas utiliser une bdd embarquée mais l'api REST. C'est l'une des perspectives pour la complétion de ce travail dans le futur.\\

Mais l'une des difficultés majeures rencontrée concerne l'installation et l'exploitation de la base de données orientée colonnes : Hbase, Cf. \ref{sec:Hbase}.
En effet, le choix du type de base de donnée NoSQL (en l'occurrence dans ce cas là, celle orientée colonnes) et la manière de stocker les données en structurant les triples pour celle-ci,  afin de la lier avec les autres via l'API JENA ne relève pas de l'impossible, mais reste très difficile, ceci est dû principalement au manque de documentation.

Malgré les difficultés rencontrées pour la mise en place de ce système d'interconnexion des sources de données, ce projet nous a avant tout permis de nous familiariser et d'expérimenter l'API Jena, en complément au processus théorique et expérimental vu en Cours et TP durant le semestre.\\
Nous avons en fin de compte pu intégrer 3 solutions sur les 4 initiales (D2RQ, TDB et Neo4j), et nous avons pu interroger le modèle faisant office de l'union de ces derniers.\\
On peut dire qu'on a retenu que l'interconnexion des données simplifie énormément l'exploitation de celle-ci, puisque le système voulant les exploiter devient plus performant ainsi.
%-----------------------------------------------------------

\newpage
\section{Sources}
\begin{itemize}
\item API Jena et TDB : \href{http://jena.apache.org/}{http://jena.apache.org/}
 \\
\item D2RQ : \href{http://d2rq.org/}{http://d2rq.org/}
\\
\item Neo4J : \href{http://neo4j.org/}{http://neo4j.org/}
\\
\item Hbase :\label{sec:shbase}
\begin{itemize}
\item \href{http://blog.xebia.fr/2009/11/18/devoxx-jour-1-nosql-avec-hbase/}{http://blog.xebia.fr/2009/11/18/devoxx-jour-1-nosql-avec-hbase/}
 \item \href{http://hbase.apache.org/}{http://hbase.apache.org/}
\end{itemize}

\item SPARQL : \href{http://www.sparql.org/}{http://www.sparql.org/}
\\
\item Geonames : \href{http://www.geonames.org/}{http://www.geonames.org/}
\\
\item INSEE : \href{http://rdf.insee.fr/}{http://rdf.insee.fr/}
\\
\item Données sur le tourisme : \href{http://data.gouv.fr/fr/dataset/residences-de-tourisme-classees-en-france/}{http://data.gouv.fr/fr/dataset/residences-de-tourisme-classees-en-france/}

\end{itemize}

%-----------------------------------------------------------

\end{document}

%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% coding: utf-8
%%% End:
